src/test/resources/api-response/open-banking/payment-charge.json

{
  "id": "s-pay-300",
  "state": {
    "id": 0,
    "name": "pending"
  },
  "amount": {
    "total": "10.0000",
    "charged": "0.0000",
    "canceled": "0.0000",
    "remaining": "10.0000"
  },
  "currency": "EUR",
  "resources": {
    "paymentId": "s-pay-300",
    "traceId": "b2f9c67bebafa3cd49b3d50f9ff00639",
    "typeId": "s-obp-q0nucec6itwe"
  },
  "transactions": [
    {
      "date": "2023-01-31 04:44:41",
      "type": "charge",
      "status": "success",
      "url": "https://sbx-api.unzer.com/v1/payments/s-pay-300/charges/s-chg-2",
      "amount": "10.0000"
    }
  ]
}